app/controllers/drives_controller.rb

  def index
    @drives = Drive.all
---
SELECT `drives`.* FROM `drives`