app/controllers/sessions_controller.rb

INSERT INTO `users` (`created_at`, `email`, `location`, `name`, `oauth_expires_at`, `oauth_token`, `photo`, `provider`, `uid`, `updated_at`) VALUES ('2014-05-21 11:48:33', 'sairam1274@gmail.com', NULL, 'RAM\' s', NULL, 'ya29.HQBAvk3cx5nSLxsAAADGXERPTMsxKGpVgRs05Cf9gF7i_S7-UXh9e7rrgTFvlA', 'https://lh3.googleusercontent.com/-cikqJlWnp4I/AAAAAAAAAAI/AAAAAAAAAhw/6UhR7W-dL5I/photo.jpg', 'google_oauth2', '106242108312684427776', '2014-05-21 11:48:33')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'google_oauth2' AND `users`.`uid` = '106242108312684427776' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"], auth["image"]) || User.create_with_omniauth(auth)